#include <stdio.h>
int main()
{
    int a[15]={52,60,514,48,56,95,32,15,89,65,75,156,896,352,458};
    int i;
    for(i=0;i<14;i++)  //循环a数组下标0-13
    {
        for(int n=i+1;n<15;n++)  //循环a数组下标1-14
        {
            if(a[i]>a[n])  //如果a数组下标i的值大于下标n的值，则交换
            {
                int temp=a[i];
                a[i]=a[n];
                a[n]=temp;
            }
        }
    }
    //上述循环嵌套进行从a[0]与a[1]开始比较，直到a[0]与a[14]比较；
    //然后进行a[1]与a[2]比较，直到a[1]与a[14]比较；
    //以此类推，直到a[13]与a[14]比较完成排序；
    for(i=0;i<15;i++)  //循环输出排序后的数组验证结果
    {
        printf("%d ",a[i]);
    }
    printf("\n");
}
